Tekla.Structures.Dialog.PluginLoader
Class for loading and registering plugin dialogs.

Tekla.Structures.Dialog.PluginLoader.PluginDialogs
Gets the dictionary of loaded plugin dialogs.

Tekla.Structures.Dialog.PluginLoader.Errors
Gets the list of errors that occurred during loading.

Tekla.Structures.Dialog.PluginLoader.#ctor(Tekla.Structures.Dialog.Localization)
Constructor for PluginLoader.
localization: Localizer for error messages

Tekla.Structures.Dialog.PluginLoader.LoadDialogPlugins
Loads the plugin dialogs from the specified directories.